results/local_nvme/fio-rw:rw-rwmixread:66-numjobs:10-iodepth:1-bs:1M.out
fio-rw:rw-rwmixread:66-numjobs:10-iodepth:1-bs:1M: (g=0): rw=rw, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
fio-3.28
Starting 10 processes
fio-rw:rw-rwmixread:66-numjobs:10-iodepth:1-bs:1M: Laying out IO file (1 file / 4096MiB)
fio-rw:rw-rwmixread:66-numjobs:10-iodepth:1-bs:1M: Laying out IO file (1 file / 4096MiB)
fio-rw:rw-rwmixread:66-numjobs:10-iodepth:1-bs:1M: Laying out IO file (1 file / 4096MiB)
[...]

fio-rw:rw-rwmixread:66-numjobs:10-iodepth:1-bs:1M: (groupid=0, jobs=10): err= 0: pid=165452: Sun Feb 25 17:16:22 2024
  read: IOPS=2911, BW=2912MiB/s (3053MB/s)(858GiB/301638msec)
    slat (usec): min=118, max=94028, avg=2111.34, stdev=1752.79
    clat (nsec): min=482, max=91464, avg=3553.05, stdev=2366.21
     lat (usec): min=119, max=94034, avg=2116.05, stdev=1754.80
    clat percentiles (nsec):
     |  1.00th=[  644],  5.00th=[  740], 10.00th=[  852], 20.00th=[ 1592],
     | 30.00th=[ 2128], 40.00th=[ 2576], 50.00th=[ 3088], 60.00th=[ 3696],
     | 70.00th=[ 4576], 80.00th=[ 5920], 90.00th=[ 6688], 95.00th=[ 7008],
     | 99.00th=[ 7520], 99.50th=[ 8032], 99.90th=[19840], 99.95th=[26240],
     | 99.99th=[59136]
   bw (  MiB/s): min=   80, max=18619, per=100.00%, avg=3423.93, stdev=222.35, samples=5120
   iops        : min=   80, max=18619, avg=3422.48, stdev=222.35, samples=5120
  write: IOPS=1502, BW=1502MiB/s (1575MB/s)(442GiB/301638msec); 0 zone resets
    slat (usec): min=182, max=44287, avg=734.72, stdev=339.74
    clat (nsec): min=478, max=81670, avg=1939.94, stdev=1299.88
     lat (usec): min=182, max=44292, avg=737.31, stdev=340.50
    clat percentiles (nsec):
     |  1.00th=[  644],  5.00th=[  740], 10.00th=[  836], 20.00th=[ 1128],
     | 30.00th=[ 1416], 40.00th=[ 1624], 50.00th=[ 1784], 60.00th=[ 1960],
     | 70.00th=[ 2160], 80.00th=[ 2544], 90.00th=[ 3216], 95.00th=[ 3696],
     | 99.00th=[ 4512], 99.50th=[ 4896], 99.90th=[11968], 99.95th=[21376],
     | 99.99th=[50944]
   bw (  MiB/s): min=   47, max= 9665, per=100.00%, avg=1767.12, stdev=116.75, samples=5117
   iops        : min=   47, max= 9665, avg=1766.32, stdev=116.74, samples=5117
  lat (nsec)   : 500=0.01%, 750=5.48%, 1000=8.56%
  lat (usec)   : 2=24.87%, 4=36.54%, 10=24.34%, 20=0.13%, 50=0.07%
  lat (usec)   : 100=0.02%
  cpu          : usr=7.92%, sys=43.93%, ctx=1497068, majf=0, minf=185
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=878362,453070,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=2912MiB/s (3053MB/s), 2912MiB/s-2912MiB/s (3053MB/s-3053MB/s), io=858GiB (921GB), run=301638-301638msec
  WRITE: bw=1502MiB/s (1575MB/s), 1502MiB/s-1502MiB/s (1575MB/s-1575MB/s), io=442GiB (475GB), run=301638-301638msec

Disk stats (read/write):
  nvme0n1: ios=1498205/1292428, merge=0/116, ticks=6326497/7632539, in_queue=13959036, util=99.93%