results/local_nvme/fio-rw:rw-rwmixread:66-numjobs:10-iodepth:3-bs:4k.out
fio-rw:rw-rwmixread:66-numjobs:10-iodepth:3-bs:4k: (g=0): rw=rw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=3
...
fio-3.28
Starting 10 processes
fio-rw:rw-rwmixread:66-numjobs:10-iodepth:3-bs:4k: Laying out IO file (1 file / 4096MiB)
fio-rw:rw-rwmixread:66-numjobs:10-iodepth:3-bs:4k: Laying out IO file (1 file / 4096MiB)
fio-rw:rw-rwmixread:66-numjobs:10-iodepth:3-bs:4k: Laying out IO file (1 file / 4096MiB)
[...]

fio-rw:rw-rwmixread:66-numjobs:10-iodepth:3-bs:4k: (groupid=0, jobs=10): err= 0: pid=165490: Sun Feb 25 17:22:12 2024
  read: IOPS=721k, BW=2814MiB/s (2951MB/s)(838GiB/304747msec)
    slat (nsec): min=724, max=128626k, avg=6711.06, stdev=109178.35
    clat (usec): min=2, max=7462.2k, avg=18.61, stdev=3224.19
     lat (usec): min=3, max=7462.2k, avg=25.45, stdev=3226.05
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    5], 10.00th=[    5], 20.00th=[    6],
     | 30.00th=[    7], 40.00th=[    8], 50.00th=[    8], 60.00th=[    9],
     | 70.00th=[   10], 80.00th=[   12], 90.00th=[   14], 95.00th=[   16],
     | 99.00th=[   25], 99.50th=[   74], 99.90th=[ 2073], 99.95th=[ 2671],
     | 99.99th=[ 5080]
   bw (  MiB/s): min=   55, max= 9623, per=100.00%, avg=3300.92, stdev=144.45, samples=5185
   iops        : min=14259, max=2463704, avg=845034.99, stdev=36979.24, samples=5185
  write: IOPS=371k, BW=1450MiB/s (1521MB/s)(432GiB/304747msec); 0 zone resets
    slat (nsec): min=1147, max=13497k, avg=3700.23, stdev=9942.09
    clat (usec): min=2, max=7022.1k, avg=18.68, stdev=3009.20
     lat (usec): min=4, max=7022.1k, avg=22.53, stdev=3009.22
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    5], 10.00th=[    6], 20.00th=[    7],
     | 30.00th=[    7], 40.00th=[    8], 50.00th=[    9], 60.00th=[   10],
     | 70.00th=[   11], 80.00th=[   12], 90.00th=[   14], 95.00th=[   16],
     | 99.00th=[   24], 99.50th=[   72], 99.90th=[ 2057], 99.95th=[ 2671],
     | 99.99th=[ 5080]
   bw (  MiB/s): min=   30, max= 4945, per=100.00%, avg=1701.09, stdev=74.39, samples=5184
   iops        : min= 7899, max=1266066, avg=435478.82, stdev=19043.79, samples=5184
  lat (usec)   : 4=0.61%, 10=69.25%, 20=28.40%, 50=1.23%, 100=0.03%
  lat (usec)   : 250=0.03%, 500=0.10%, 750=0.06%, 1000=0.04%
  lat (msec)   : 2=0.14%, 4=0.09%, 10=0.02%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2000=0.01%, >=2000=0.01%
  cpu          : usr=18.51%, sys=46.71%, ctx=1329473, majf=0, minf=250
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=219572153,113132662,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=3

Run status group 0 (all jobs):
   READ: bw=2814MiB/s (2951MB/s), 2814MiB/s-2814MiB/s (2951MB/s-2951MB/s), io=838GiB (899GB), run=304747-304747msec
  WRITE: bw=1450MiB/s (1521MB/s), 1450MiB/s-1450MiB/s (1521MB/s-1521MB/s), io=432GiB (463GB), run=304747-304747msec

Disk stats (read/write):
  nvme0n1: ios=1452949/1145104, merge=0/62, ticks=5752609/9224248, in_queue=14976857, util=99.85%